Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/spi_reg.h
    /* 0xc  reserved */
    uint8_t RESERVED0xc[4];

    /* 0x10 : spi_prd_0 */
    union {
        struct
        {
            uint32_t cr_spi_prd_s      : 8; /* [ 7: 0],        r/w,        0xf */
            uint32_t cr_spi_prd_p      : 8; /* [15: 8],        r/w,        0xf */
            uint32_t cr_spi_prd_d_ph_0 : 8; /* [23:16],        r/w,        0xf */
            uint32_t cr_spi_prd_d_ph_1 : 8; /* [31:24],        r/w,        0xf */
        } BF;
        uint32_t WORD;
    } spi_prd_0;

    /* 0x14 : spi_prd_1 */
    union {
        struct
        {
            uint32_t cr_spi_prd_i  : 8;  /* [ 7: 0],        r/w,        0xf */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_prd_1;

    /* 0x18 : spi_rxd_ignr */
    union {
        struct
        {
            uint32_t cr_spi_rxd_ignr_p : 5;  /* [ 4: 0],        r/w,        0x0 */
            uint32_t reserved_5_15     : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t cr_spi_rxd_ignr_s : 5;  /* [20:16],        r/w,        0x0 */
            uint32_t reserved_21_31    : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_rxd_ignr;

    /* 0x1C : spi_sto_value */
    union {
        struct
        {
            uint32_t cr_spi_sto_value : 12; /* [11: 0],        r/w,      0xfff */
            uint32_t reserved_12_31   : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_sto_value;

    /* 0x20  reserved */
    uint8_t RESERVED0x20[96];

    /* 0x80 : spi_fifo_config_0 */
    union {
        struct
        {
            uint32_t spi_dma_tx_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t spi_dma_rx_en     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_fifo_config_0;

    /* 0x84 : spi_fifo_config_1 */
    union {
        struct
        {
            uint32_t tx_fifo_cnt    : 3; /* [ 2: 0],          r,        0x4 */
            uint32_t reserved_3_7   : 5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t rx_fifo_cnt    : 3; /* [10: 8],          r,        0x0 */
            uint32_t reserved_11_15 : 5; /* [15:11],       rsvd,        0x0 */
            uint32_t tx_fifo_th     : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_23 : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t rx_fifo_th     : 2; /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_fifo_config_1;

    /* 0x88 : spi_fifo_wdata */
    union {
        struct
        {
            uint32_t spi_fifo_wdata : 32; /* [31: 0],          w,          x */
        } BF;
        uint32_t WORD;
    } spi_fifo_wdata;

    /* 0x8C : spi_fifo_rdata */
    union {
        struct
        {
            uint32_t spi_fifo_rdata : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } spi_fifo_rdata;
};

typedef volatile struct spi_reg spi_reg_t;

#endif /* __SPI_REG_H__ */
